PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
#include "mqtt_manager.h"
#include "esp32_id_manager.h"
#include <string.h>
#include <stdio.h>
#include <inttypes.h>
#include <errno.h>
#include <time.h>
#include <sys/socket.h>
#include <netdb.h>
#include <lwip/netdb.h>
#include <lwip/sockets.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "esp_log.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "mqtt_client.h"
#include "esp_tls.h"
#include "mqtt_ssl_setup.h"
#include "esp_random.h"
#include "config_manager.h"
#include "wifi_manager.h"
#include "time_manager.h"

#define TAG "MQTT_MGR"

#define MQTT_CONNECTED_BIT BIT0
#define MQTT_DISCONNECTED_BIT BIT1
#define MQTT_ERROR_BIT BIT2

#define DEFAULT_BROKER "node02.myqtthub.com"
#define DEFAULT_PORT 8883
#define DEFAULT_KEEPALIVE 120
#define DEFAULT_RECONNECT_TIMEOUT_MS 30000
#define DEFAULT_BUFFER_SIZE 1024
#define DEFAULT_MAX_QUEUE_SIZE 20
#define MAX_TOPIC_LENGTH 128
#define MAX_MESSAGE_LENGTH 1024
#define MIN_MESSAGE_INTERVAL_MS 100

typedef struct {
    char topic[MAX_TOPIC_LENGTH];
    char data[DEFAULT_BUFFER_SIZE];
    int data_len;
    int qos;
    bool retain;
} mqtt_pending_message_t;

typedef struct {
    mqtt_manager_state_t state;
    esp_mqtt_client_handle_t client;
    EventGroupHandle_t event_group;
    SemaphoreHandle_t mutex;
    SemaphoreHandle_t buffer_mutex;
    QueueHandle_t pending_messages;
    uint32_t event_group_operations;
    
    char broker_url[MQTT_BROKER_MAX_LENGTH];
    int port;
    bool use_ssl;
    char client_id[MQTT_CLIENT_ID_MAX_LENGTH];
    char username[MQTT_USERNAME_MAX_LENGTH];
    char password[MQTT_PASSWORD_MAX_LENGTH];
    char lwt_topic[MQTT_TOPIC_MAX_LENGTH];
    char lwt_message[MQTT_LWT_MESSAGE_MAX_LENGTH];
    int lwt_qos;
    bool lwt_retain;
    
    char esp32_id[ESP32_ID_BUFFER_SIZE];
    char mac_address[ESP32_MAC_BUFFER_SIZE];
    
    bool was_connected;
    int reconnect_attempts;
    int64_t last_reconnect_time;
    int64_t last_activity_time;
    int64_t last_message_time;
    
    mqtt_manager_message_callback_t message_callback;
    void *message_user_data;
    mqtt_manager_state_callback_t state_callback;
    void *state_user_data;
    
    char panel_id[32];        
    char client_panel_id[32]; 
    
    char config_topic[MQTT_TOPIC_MAX_LENGTH];
    
    char *buffer_pool[5];
    bool buffer_in_use[5];
    SemaphoreHandle_t pool_mutex;
} mqtt_manager_context_t;

static mqtt_manager_context_t s_mqtt_manager_ctx = {0};

static esp_err_t recreate_mqtt_event_group(mqtt_manager_context_t *ctx) {
    EventBits_t current_bits = xEventGroupGetBits(ctx->event_group);
    
    vEventGroupDelete(ctx->event_group);
    ctx->event_group = xEventGroupCreate();
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "Failed to recreate MQTT event group");
        return ESP_ERR_NO_MEM;
    }
    
    if (current_bits != 0) {
        xEventGroupSetBits(ctx->event_group, current_bits);
    }
    
    ctx->event_group_operations = 0;
    ESP_LOGI(TAG, "MQTT event group recreated");
    return ESP_OK;
}

static void safe_mqtt_set_bits(mqtt_manager_context_t *ctx, EventBits_t bits) {
    ctx->event_group_operations++;
    
    if (ctx->event_group_operations >= 1000000) {
        recreate_mqtt_event_group(ctx);
    }
    
    xEventGroupSetBits(ctx->event_group, bits);
}

static void safe_mqtt_clear_bits(mqtt_manager_context_t *ctx, EventBits_t bits) {
    ctx->event_group_operations++;
    
    if (ctx->event_group_operations >= 1000000) {
        recreate_mqtt_event_group(ctx);
    }
    
    xEventGroupClearBits(ctx->event_group, bits);
}

static char* mqtt_get_buffer(mqtt_manager_context_t *ctx) {
    if (xSemaphoreTake(ctx->buffer_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < 5; i++) {
            if (!ctx->buffer_in_use[i]) {
                ctx->buffer_in_use[i] = true;
                memset(ctx->buffer_pool[i], 0, MAX_MESSAGE_LENGTH);
                xSemaphoreGive(ctx->buffer_mutex);
                return ctx->buffer_pool[i];
            }
        }
        xSemaphoreGive(ctx->buffer_mutex);
        
        size_t free_heap = esp_get_free_heap_size();
        if (free_heap < 50000) {
            ESP_LOGW(TAG, "Low memory during buffer allocation: %zu bytes", free_heap);
            mqtt_manager_emergency_memory_cleanup();
        }
    }
    return NULL;
}

static void mqtt_release_buffer(mqtt_manager_context_t *ctx, char *buffer) {
    if (xSemaphoreTake(ctx->buffer_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < 3; i++) {
            if (ctx->buffer_pool[i] == buffer) {
                ctx->buffer_in_use[i] = false;
                break;
            }
        }
        xSemaphoreGive(ctx->buffer_mutex);
    }
}

static esp_err_t validate_esp32_id(const char *esp32_id) {
    if (esp32_id == NULL) {
        ESP_LOGE(TAG, "ESP32 ID is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    size_t len = strlen(esp32_id);
    if (len == 0 || len > ESP32_ID_LENGTH) {
        ESP_LOGE(TAG, "ESP32 ID invalid length: %zu", len);
        return ESP_ERR_INVALID_ARG;
    }
    
    for (size_t i = 0; i < len; i++) {
        char c = esp32_id[i];
        if (!((c >= '0' && c <= '9') || (c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z'))) {
            ESP_LOGE(TAG, "ESP32 ID contains invalid character: '%c'", c);
            return ESP_ERR_INVALID_ARG;
        }
    }
    
    return ESP_OK;
}

static bool should_process_message(int64_t current_time) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (current_time - ctx->last_message_time < MIN_MESSAGE_INTERVAL_MS) {
        return false;
    }
    
    ctx->last_message_time = current_time;
    return true;
}

static void mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data) {
    esp_mqtt_event_handle_t event = (esp_mqtt_event_handle_t)event_data;
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    int64_t current_time = esp_timer_get_time() / 1000;
    ctx->last_activity_time = current_time;
    
    switch (event->event_id) {
        case MQTT_EVENT_CONNECTED:
            ESP_LOGI(TAG, "MQTT connected");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                ctx->state = MQTT_MANAGER_STATE_CONNECTED;
                ctx->was_connected = true;
                ctx->reconnect_attempts = 0;
                xSemaphoreGive(ctx->mutex);
            }
            
            safe_mqtt_clear_bits(ctx, MQTT_DISCONNECTED_BIT | MQTT_ERROR_BIT);
            safe_mqtt_set_bits(ctx, MQTT_CONNECTED_BIT);
            
