PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            
            if (strlen(ctx->esp32_id) > 0) {
                snprintf(ctx->config_topic, sizeof(ctx->config_topic), "esp32/config/%s", ctx->esp32_id);
                mqtt_manager_subscribe(ctx->config_topic, 2);
                
                char notify_topic[MQTT_TOPIC_MAX_LENGTH];
                snprintf(notify_topic, sizeof(notify_topic), "esp32/notify/%s/deleted", ctx->esp32_id);
                mqtt_manager_subscribe(notify_topic, 2);
                
                mqtt_manager_subscribe("clients/+/panels/+/relay_config", 2);
                mqtt_manager_subscribe("clients/+/panels/+/relays", 2);
            }
            
            mqtt_pending_message_t pending_msg;
            int pending_count = 0;
            while (xQueueReceive(ctx->pending_messages, &pending_msg, 0) == pdTRUE && pending_count < 5) {
                esp_mqtt_client_publish(event->client, pending_msg.topic, pending_msg.data, 
                                        pending_msg.data_len, pending_msg.qos, pending_msg.retain);
                pending_count++;
                vTaskDelay(pdMS_TO_TICKS(50));
            }
            break;
            
        case MQTT_EVENT_DISCONNECTED:
            ESP_LOGW(TAG, "MQTT disconnected");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                ctx->state = MQTT_MANAGER_STATE_RECONNECTING;
                ctx->reconnect_attempts++;
                xSemaphoreGive(ctx->mutex);
            }
            
            safe_mqtt_clear_bits(ctx, MQTT_CONNECTED_BIT);
            safe_mqtt_set_bits(ctx, MQTT_DISCONNECTED_BIT);
            
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            break;
            
        case MQTT_EVENT_SUBSCRIBED:
            ESP_LOGI(TAG, "MQTT subscribed, msg_id=%d", event->msg_id);
            break;
            
        case MQTT_EVENT_PUBLISHED:
            break;
            
        case MQTT_EVENT_DATA:
            if (ctx->message_callback && 
                event->topic_len > 0 && event->topic_len < MAX_TOPIC_LENGTH &&
                event->data_len > 0 && event->data_len < MAX_MESSAGE_LENGTH) {
                
                if (!should_process_message(current_time)) {
                    ESP_LOGD(TAG, "Message rate limited, skipping");
                    break;
                }
                
                char *topic_buffer = mqtt_get_buffer(ctx);
                char *message_buffer = mqtt_get_buffer(ctx);
                
                if (topic_buffer && message_buffer) {
                    memcpy(topic_buffer, event->topic, event->topic_len);
                    topic_buffer[event->topic_len] = '\0';
                    
                    memcpy(message_buffer, event->data, event->data_len);
                    message_buffer[event->data_len] = '\0';
                    
                    ctx->message_callback(topic_buffer, message_buffer, event->data_len, ctx->message_user_data);
                    
                    mqtt_release_buffer(ctx, topic_buffer);
                    mqtt_release_buffer(ctx, message_buffer);
                }
            }
            break;
            
        case MQTT_EVENT_ERROR:
            ESP_LOGE(TAG, "MQTT error");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(50)) == pdTRUE) {
                ctx->state = MQTT_MANAGER_STATE_RECONNECTING;
                ctx->reconnect_attempts++;
                xSemaphoreGive(ctx->mutex);
            }
            
            safe_mqtt_clear_bits(ctx, MQTT_CONNECTED_BIT);
            safe_mqtt_set_bits(ctx, MQTT_ERROR_BIT);
            
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            break;
            
        default:
            break;
    }
}

esp_err_t mqtt_manager_init(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group != NULL) {
        ESP_LOGW(TAG, "Already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Initializing MQTT Manager");
    
    memset(ctx, 0, sizeof(mqtt_manager_context_t));
    
    ctx->state = MQTT_MANAGER_STATE_INIT;
    
    ctx->event_group = xEventGroupCreate();
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "Failed to create event group");
        return ESP_ERR_NO_MEM;
    }
    
    ctx->mutex = xSemaphoreCreateMutex();
    if (ctx->mutex == NULL) {
        vEventGroupDelete(ctx->event_group);
        ctx->event_group = NULL;
        ESP_LOGE(TAG, "Failed to create mutex");
        return ESP_ERR_NO_MEM;
    }
    
    ctx->buffer_mutex = xSemaphoreCreateMutex();
    if (ctx->buffer_mutex == NULL) {
        vSemaphoreDelete(ctx->mutex);
        vEventGroupDelete(ctx->event_group);
        ctx->mutex = NULL;
        ctx->event_group = NULL;
        ESP_LOGE(TAG, "Failed to create buffer mutex");
        return ESP_ERR_NO_MEM;
    }
    
    for (int i = 0; i < 5; i++) {
        ctx->buffer_pool[i] = heap_caps_malloc(MAX_MESSAGE_LENGTH, MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
        if (ctx->buffer_pool[i] == NULL) {
            for (int j = 0; j < i; j++) {
                free(ctx->buffer_pool[j]);
            }
            vSemaphoreDelete(ctx->buffer_mutex);
            vSemaphoreDelete(ctx->mutex);
            vEventGroupDelete(ctx->event_group);
            return ESP_ERR_NO_MEM;
        }
        ctx->buffer_in_use[i] = false;
    }
    
    ctx->pending_messages = xQueueCreate(DEFAULT_MAX_QUEUE_SIZE, sizeof(mqtt_pending_message_t));
    if (ctx->pending_messages == NULL) {
        for (int i = 0; i < 5; i++) {
            free(ctx->buffer_pool[i]);
        }
        vSemaphoreDelete(ctx->buffer_mutex);
        vSemaphoreDelete(ctx->mutex);
        vEventGroupDelete(ctx->event_group);
        ctx->mutex = NULL;
        ctx->event_group = NULL;
        ESP_LOGE(TAG, "Failed to create message queue");
        return ESP_ERR_NO_MEM;
    }
    
    strncpy(ctx->broker_url, DEFAULT_BROKER, sizeof(ctx->broker_url) - 1);
    ctx->broker_url[sizeof(ctx->broker_url) - 1] = '\0';
    ctx->port = DEFAULT_PORT;
    ctx->use_ssl = true;
    ctx->lwt_qos = 1;
    ctx->lwt_retain = false;
    
    ctx->state = MQTT_MANAGER_STATE_DISCONNECTED;
    safe_mqtt_set_bits(ctx, MQTT_DISCONNECTED_BIT);
    
