PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
esp_err_t mqtt_manager_set_message_callback(mqtt_manager_message_callback_t callback, void *user_data) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->message_callback = callback;
        ctx->message_user_data = user_data;
        xSemaphoreGive(ctx->mutex);
    }
    
    return ESP_OK;
}

esp_err_t mqtt_manager_set_state_callback(mqtt_manager_state_callback_t callback, void *user_data) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->state_callback = callback;
        ctx->state_user_data = user_data;
        xSemaphoreGive(ctx->mutex);
    }
    
    return ESP_OK;
}

mqtt_manager_state_t mqtt_manager_get_state(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return MQTT_MANAGER_STATE_INIT;
    }
    
    return ctx->state;
}

static char network_info_buffer[1024];
static SemaphoreHandle_t network_buffer_mutex = NULL;

esp_err_t mqtt_manager_send_network_info(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || strlen(ctx->esp32_id) == 0) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (network_buffer_mutex == NULL) {
        network_buffer_mutex = xSemaphoreCreateMutex();
        if (network_buffer_mutex == NULL) {
            return ESP_ERR_NO_MEM;
        }
    }
    
    if (xSemaphoreTake(network_buffer_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    
    char ip_address[16] = "0.0.0.0";
    wifi_manager_get_ip(ip_address, sizeof(ip_address));
    
    char timestamp_str[16];
    char time_str[32];
    
    if (time_manager_is_synchronized()) {
        time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
        time_manager_get_lima_time_str(time_str, sizeof(time_str));
    } else {
        time_t now = time(NULL);
        if (now > 1577836800) {
            snprintf(timestamp_str, sizeof(timestamp_str), "%ld", (long)now);
            struct tm *timeinfo = gmtime(&now);
            if (timeinfo) {
                time_t peru_time = now - (5 * 3600);
                struct tm *peru_timeinfo = gmtime(&peru_time);
                if (peru_timeinfo) {
                    strftime(time_str, sizeof(time_str), "%d/%m/%Y, %H:%M:%S", peru_timeinfo);
                } else {
                    strcpy(time_str, "Time unavailable");
                }
            } else {
                strcpy(time_str, "Time unavailable");
            }
        } else {
            snprintf(timestamp_str, sizeof(timestamp_str), "%lld", (long long)(esp_timer_get_time() / 1000));
            snprintf(time_str, sizeof(time_str), "System: %lld ms", (long long)(esp_timer_get_time() / 1000));
        }
    }
    
    const char *current_status = "ONLINE";
    if (strlen(ctx->panel_id) == 0 || strlen(ctx->client_panel_id) == 0) {
        current_status = "AWAITING_CONFIG";
    }
    
    int len = snprintf(network_info_buffer, sizeof(network_info_buffer),
                      "{\"esp32_id\":\"%.8s\",\"MAC\":\"%.12s\",\"IP\":\"%.15s\","
                      "\"status\":\"%s\",\"timestamp\":%.12s,\"time\":\"%.25s\"",
                      ctx->esp32_id, ctx->mac_address, ip_address, 
                      current_status, timestamp_str, time_str);
    
    if (strlen(ctx->client_panel_id) > 0 && strlen(ctx->panel_id) > 0 && len > 0) {
        int remaining_space = sizeof(network_info_buffer) - len - 2;
        if (remaining_space > 50) {
            int additional_len = snprintf(network_info_buffer + len, remaining_space,
                                        ",\"client_id\":\"%.20s\",\"panel_id\":\"%.20s\"",
                                        ctx->client_panel_id, ctx->panel_id);
            if (additional_len > 0 && additional_len < remaining_space) {
                len += additional_len;
            }
        }
    }
    
    if (len > 0 && len < sizeof(network_info_buffer) - 1) {
        network_info_buffer[len] = '}';
        network_info_buffer[len + 1] = '\0';
        len++;
    } else {
        ESP_LOGE(TAG, "Network info buffer overflow, len=%d", len);
        xSemaphoreGive(network_buffer_mutex);
        return ESP_ERR_NO_MEM;
    }
    
    if (len <= 2) {
        ESP_LOGE(TAG, "Invalid JSON length: %d", len);
        xSemaphoreGive(network_buffer_mutex);
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "Sending network info to esp32/network_info (len=%d)", len);
    
    esp_err_t result = mqtt_manager_publish("esp32/network_info", network_info_buffer, len, 1, false);
    
    xSemaphoreGive(network_buffer_mutex);
    
    return result;
}

esp_err_t mqtt_manager_set_panel_config(const char *client_id, const char *panel_id) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (!client_id || !panel_id) {
        return ESP_ERR_INVALID_ARG;
    }
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        strncpy(ctx->client_panel_id, client_id, sizeof(ctx->client_panel_id) - 1);
        ctx->client_panel_id[sizeof(ctx->client_panel_id) - 1] = '\0';
        
        strncpy(ctx->panel_id, panel_id, sizeof(ctx->panel_id) - 1);
        ctx->panel_id[sizeof(ctx->panel_id) - 1] = '\0';
        
        xSemaphoreGive(ctx->mutex);
        
        ESP_LOGI(TAG, "Panel config set: client=%s, panel=%s", client_id, panel_id);
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

esp_err_t mqtt_manager_get_panel_topic(char *topic, size_t size, const char *suffix) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (!topic || !suffix || size == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    
    if (strlen(ctx->client_panel_id) == 0 || strlen(ctx->panel_id) == 0) {
        return ESP_ERR_INVALID_STATE;
    }
    
    int ret = snprintf(topic, size, "clients/%s/panels/%s/%s", 
                      ctx->client_panel_id, ctx->panel_id, suffix);
    
    return (ret > 0 && ret < size) ? ESP_OK : ESP_ERR_INVALID_SIZE;
}

esp_err_t mqtt_manager_send_config_response(bool success, const char *message) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    char response_topic[MQTT_TOPIC_MAX_LENGTH];
    char response_data[256];
    
    if (strlen(ctx->esp32_id) == 0 || !mqtt_manager_is_connected()) {
        return ESP_ERR_INVALID_STATE;
    }
    
    snprintf(response_topic, sizeof(response_topic), "esp32/config/%s/response", ctx->esp32_id);
    
    snprintf(response_data, sizeof(response_data),
             "{\"esp32_id\":\"%s\",\"status\":\"%s\",\"message\":\"%.50s\",\"timestamp\":%lld}",
             ctx->esp32_id,
             success ? "CONFIG_ACCEPTED" : "CONFIG_ERROR",
             message ? message : (success ? "Configuration applied" : "Configuration failed"),
             (long long)(esp_timer_get_time() / 1000));
    
